Revit 2027 API
FabricationConfigurationInfo.GetAllFabricationConfigurations Method
 Gets all added fabrication configurations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<FabricationConfigurationInfo> GetAllFabricationConfigurations()
Public Shared Function GetAllFabricationConfigurations As IList(Of FabricationConfigurationInfo)
public:
static IList<FabricationConfigurationInfo^>^ GetAllFabricationConfigurations()
static member GetAllFabricationConfigurations : unit -> IList<FabricationConfigurationInfo>
Return Value
IList<FabricationConfigurationInfo>
 All added fabrication configurations.
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace